case3/backgroundMesh/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue zoneID 123 //set default zone to something random
    volScalarFieldValue alpha.water 0// optional
);

regions
(
    // Set cell values
    // (does zerogradient on boundaries)
    cellToCell //give background mesh zoneID 0
    {
        set c0;

        fieldValues
        (
            volScalarFieldValue zoneID 0
        );
    }

    cellToCell //give overset mesh zoneID 1
    {
        set c1;

        fieldValues
        (
            volScalarFieldValue zoneID 1
        );
    }

	// Optional
    cylinderToCell
    {
        p1          (0 0 0.0015);
        p2          (0 0 0.0225);
        radius      0.0035;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);

// ************************************************************************* //
